<template>
  <div class="v-personal-account-agreement">
    <h1 class="title margin2">用户注册协议</h1>
    <p class="right margin2">版本生效日期：2019年11月1日</p>
    <p class="margin0 bold underline">欢迎您申请使用翼福汇商城提供的服务。请您（用户）仔细阅读以下全部内容！</p>
    <p class="margin2 bold underline">如您（用户）不同意本服务条款任意内容，请勿注册或使用翼福汇商城服务</p>
    <h4 class="margin1 bold">一、服务条款的确认及接受</h4>
    <p class="margin1">1、翼福汇网站（指WWW.FYUANAI.COM及其移动客户端软件、应用程序，以下称“本网站”）各项电子服务的所有权和运作权归属于“翼福汇”所有，本网站提供的服务将完全按照其发布的服务条款和操作规则严格执行。如您（用户）不同意本服务条款任意内容，请勿注册或使用翼福汇商城服务，如您确认所有服务条款并完成注册程序时，本协议在您与本网站间成立并发生法律效力，同时您成为本网站正式用户。</p>
    <p class="margin1">2、为了提供更好的服务，我们可能会根据产品或服务的更新情况及法律法规的相关要求适时修改本政策的条款，翼福汇商城有权对本协议条款及相关规则不时地进行修改，修改后的内容一旦以任何形式公布在本网站上即生效，并取代此前相关内容，您应不时关注本网站公告、提示信息及协议、规则等相关内容的变动。您知悉并确认，如您不同意更新后的内容，应立即停止使用本网站；如您继续使用本网站，即视为知悉变动内容并同意接受。</p>
    <p class="margin2">3、本协议中的内容请您着重阅读。您点击“同意”按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。</p>
    <h4 class="margin1 bold">二、服务须知</h4>
    <p class="margin0">1、本网站运用自身开发的操作系统通过国际互联网络为用户提供购买商品等服务。使用本网站，您必须：</p>
    <p class="margin0">（1）自行配备上网的所需设备，包括个人手机、平板电脑、调制解调器、路由器等；</p>
    <p class="margin0">（2）自行负担个人上网所支付的与此服务有关的电话费用、网络费用等；</p>
    <p class="margin1">（3）选择与所安装终端设备相匹配的软件版本，包括但不限于iOS、Android、Windows等多个翼福汇商城发布的应用版本。</p>
    <p class="margin0">2、基于本网站所提供的网络服务的重要性，您确认并同意：</p>
    <p class="margin0">（1）提供的注册资料真实、准确、完整、合法有效，注册资料如有变动的，应及时更新；</p>
    <p class="margin2">（2）如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，并且翼福汇保留终止您使用本网站各项服务的权利。</p>
    <h4 class="margin1 bold">三、订单说明</h4>
    <p class="margin1">1、用户确认，在注册或使用翼福汇服务时，应当具备中华人民共和国法律规定的与其行为相适应的民事行为能力，确保有能力对所使用翼福汇服务的一切行为独立承担责任。若用户不具备前述主体资格，请在父母或其他监护人（以下简称“监护人”）的陪同下阅读本服务条款，并在取得监护人对使用翼福汇商城服务的行为及对本服务条款的同意之后。在下订单的同时，即视为您满足上述条件，并对您在订单中提供的所有信息的真实性负责。</p>
    <p class="margin1">2、在您下订单时，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与您本人不一致的，收货人的行为和意思表示视为您的行为和意思表示，您应对收货人的行为及意思表示的法律后果承担连带责任。</p>
    <p class="margin1">3、您理解并同意：本网站上销售商展示的商品和价格等信息仅仅是要约邀请，您下单时须填写您希望购买的商品数量、价格、货款及支付方式、收货人、联系方式、收货地址 、合同履行方式等内容；系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向销售商发出的合同要约；销售商收到您的订单信息后，只有在销售商将您在订单中订购的商品从仓库实际直接向您发出时（以商品出库为标志），方视为您与销售商之间就实际直接向您发出的商品建立了合同关系；如果您在一份订单里订购了多种商品并且销售商只给您发出了部分商品时，您与销售商之间仅就实际直接向您发出的商品建立了合同关系，只有在销售商实际直接向您发出了订单中订购的其他商品时，您和销售商之间就订单中其他已实际直接向您发出的商品才成立合同关系；对于电子书、 虚拟充值等数字化商品，您下单并支付货款后合同即成立。当您作为消费者为生活消费需要下单并支付货款的情况下，您货款支付成功后即视为您与销售商之间就已支付货款部分的订单建立了合同关系。</p>
    <p class="margin2">4、尽管销售商做出最大的努力，但由于市场变化及各种以合理商业努力难以控制因素的影响，本网站无法避免您提交的订单信息中的商品出现缺货、价格标示错误等情况；如您下单所购买的商品出现以上情况，您有权取消订单，销售商亦有权自行取消订单，若您已经付款，则为您办理退款。</p>
    <h4 class="margin1 bold">四、配送和交付说明</h4>
    <p class="margin1">1、您在本网站购买的商品将按照本网站上您所指定的送货地址进行配送。订单信息中列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。您应当清楚准确地填写您的送货地址、联系人及联系方式等配送信息，您知悉并确认，您所购买的商品应仅由您填写的联系人接受身份查验后接收商品，因您变更联系人或相关配送信息而造成的损失由您自行承担。</p>
    <p class="margin0">2、因如下情况造成订单延迟或无法配送等，本网站将无法承担迟延配送或无法配送的责任：</p>
    <p class="margin0">（1）客户提供错误信息和不详细的地址；</p>
    <p class="margin0">（2）货物送达无人签收或拒收，由此造成的重复配送所产生的费用及相关的后果。</p>
    <p class="margin1">（3）不可抗力，例如：自然灾害及恶劣天气、交通戒严等政府、司法机关的行为、决定或命令、意外交通事故、罢工、法规政策的修改、恐怖事件、抢劫、抢夺等暴力犯罪、突发战争等。</p>
    <p class="margin2">3、您在本网站购买的商品由翼福汇商城的关联方或第三方快递公司（包括顺丰、京东、EMS、邮政快递、韵达快递、跨越物流等，以下称“快递公司”）为您完成订单交付的，系统或单据记录的签收时间为交付时间；您购买的商品采用在线传输方式交付的，销售商向您指定系统发送的时间为交付时间；您购买服务的，生成的电子或者实物凭证中载明的时间为交付时间。</p>
    <h4 class="margin1 bold">五、我们如何储存用户个人信息保护及授权</h4>
    <p class="margin1">1、您知悉并同意，为方便您使用本网站相关服务，本网站将存储您在使用时的必要信息，包括但不限于您的真实姓名、性别、生日、配送地址、联系方式、通讯录、相册、日历、定位信息等。除法律法规规定的情形外，未经您的许可翼福汇商城不会向第三方公开、透露您的个人信息。翼福汇商城对相关信息采取专业加密存储与传输方式，利用合理措施保障用户个人信息的安全。</p>
    <p class="margin1">2、您知悉并确认，您在注册帐号或使用本网站的过程中，需要提供真实的身份信息，翼福汇商城将根据国家法律法规相关要求，进行基于移动电话号码的真实身份信息认证。若您提供的信息不真实、不完整，则无法使用本网站或在使用过程中受到限制，同时，由此产生的不利后果，由您自行承担。</p>
    <p class="margin1">3、您在使用本网站某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议；您使用前述特定服务，即视为您已阅读并同意接受相关单独协议。</p>
    <p class="margin0">4、您充分理解并同意：</p>
    <p class="margin0">（1）接收通过邮件、短信、电话等形式，向在本网站注册、购物的用户、收货人发送的订单信息、促销活动等内容；</p>
    <p class="margin0">（2）为配合行政监管机关、司法机关执行工作，在法律规定范围内翼福汇商城有权向上述行政、司法机关提供您在使用本网站时所储存的相关信息，包括但不限于您的注册信息等，或使用相关信息进行证据保全，包括但不限于公证、见证等；</p>
    <p class="margin0">（3）翼福汇商城依法保障您在安装或使用过程中的知情权和选择权，在您使用本网站服务过程中，涉及您设备自带功能的服务会提前征得您同意，您一经确认，翼福汇商城有权开启包括但不限于收集地理位置、读取通讯录、使用摄像头、启用录音等提供服务必要的辅助功能。</p>
    <p class="margin2">（4）翼福汇商城有权根据实际情况，在法律规定范围内自行决定单个用户在本网站及服务中数据的最长储存期限以及用户日志的储存期限，并在服务器上为其分配数据最大存储空间等。</p>
    <h4 class="margin1 bold">六、用户行为规范</h4>
    <p class="margin0">1、本协议依据国家相关法律法规规章制定，您同意严格遵守以下义务：</p>
    <p class="margin0">（1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</p>
    <p class="margin0">（2）从中国大陆向境外传输资料信息时必须符合中国有关法规；</p>
    <p class="margin0">（3）不得利用本网站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</p>
    <p class="margin0">（4）不得干扰本网站的正常运转，不得侵入本网站及国家计算机信息系统；</p>
    <p class="margin0">（5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、淫秽的、不文明的等信息资料；</p>
    <p class="margin0">（6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</p>
    <p class="margin0">（7）不得教唆他人从事本条所禁止的行为；</p>
    <p class="margin0">（8）不得利用在本网站注册的账户进行牟利性经营活动；</p>
    <p class="margin1">（9）不得发布任何侵犯他人隐私、个人信息、著作权、商标权等知识产权或合法权利的内容；</p>
    <p class="margin2">2、您须对自己在网上的言论和行为承担法律责任，您若在本网站上散布和传播反动、色情或其它违反国家法律的信息，本网站的系统记录有可能作为您违反法律的证据。</p>
    <h4 class="margin1 bold">七、本商城使用规范</h4>
    <p class="margin0">1、关于移动客户端软件的获取与更新：</p>
    <p class="margin2">（1）您可以直接从翼福汇网站上获取翼福汇移动客户端软件，也可以从得到安卓、苹果授权的第三方获取，如果您从未经翼福汇授权的第三方获取软件或与翼福汇移动客户端软件名称相同的安装程序，翼福汇商城无法保证该软件能够正常使用，并对因此给您造成的损失不予负责；</p>
    <h4 class="margin1 bold">八、违约责任</h4>
    <p class="margin1">1、如果翼福汇商城发现或收到他人举报投诉您违反本协议约定或存在任何恶意行为的，翼福汇商城有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规帐号处以包括但不限于警告、限制或禁止使用部分或全部功能、帐号封禁、注销等处罚，并公告处理结果。</p>
    <p class="margin2">2、您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；翼福汇商城因此遭受损失的，您也应当一并赔偿。</p>
    <h4 class="margin1 bold">九、所有权及知识产权</h4>
    <p class="margin1">1、您一旦接受本协议，对于您提供、上传、创作、发布在本网站的文字、评论、图片、照片、视频、音频等任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等），您免费授予翼福汇商城及其关联公司至保护期终止为止、不可撤销的、全球范围的、排他的许可使用著作权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可许可使用的权利）、肖像权、用户ID名称等相关的全部合法权利权益，就翼福汇具有诉讼主体资格的权利、权益，翼福汇商城有权以自身名义对第三方侵权行为取证及提起诉讼。您同意翼福汇商城及其关联公司有权存储、使用、复制、修订、编辑、发布、展示、翻译、分发、推广、出版、发行、信息网络传播您以上信息内容，有权改编制作派生作品，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。</p>
    <p class="margin1">2、翼福汇商城有权再许可给其他第三方第九条第一款的所有权利。</p>
    <p class="margin1">3、您应确保在翼福汇商城上发表的第九条第一款各类信息内容均不涉及侵犯第三方肖像、隐私、知识产权或其他合法权益。否则翼福汇商城有权随时采取包括但不限于删除、断开链接等措施。</p>
    <p class="margin1">4、本协议已经构成《中华人民共和国著作权法》第二十四条（条文序号依照2010年修订版《著作权法》确定）及相关法律规定的著作财产权等权利许可使用的书面协议，其效力及于您在本网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。</p>
    <p class="margin2">5、您同意并已充分了解本协议的条款，承诺不将已发表于本网站的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。</p>
    <h4 class="margin1 bold">十、法律管辖适用及其他</h4>
    <p class="margin1">1、本协议的订立、执行和解释及争议的解决均应适用中国法律。如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，应向协议签订地有管辖权的人民法院提起诉讼。本协议签订地为中华人民共和国深圳市福田区。</p>
    <p class="margin2">2、如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</p>
    <h4 class="margin1 bold">十一、如何联系我们</h4>
    <p class="margin1">1、我们设立了个人信息保护专职部门，将按照本政策保护您的个人信息。如您有关于网络信息安全的投诉和举报，或您对本政策、翼福汇商城的隐私措施、您的信息的相关事宜有任何问题、意见或建议，请与翼福汇商城的个人信息保护工作人员联系，可发送邮件至FYUANAI@FYUANAI.COM或写信至以下地址：深圳市福田区上梅林理想时代大厦8C     信息保护专员（收）；邮编：518049。</p>
    <p class="margin2">2、我们将在收到您的问题、意见或建议，并验证您的用户身份后的7天内予以回复。</p>
  </div>
</template>

<script>
  export default {
    name: "agreementDetail"
  }
</script>

<style lang="scss">
  .v-personal-account-agreement {
    font-size: 16px;
    line-height: 1.5;
    padding: 20px 10px;
    .title {
      font-size: 24px;
      font-weight: bold;
      text-align: center;
    }
    .right {
      text-align: right;
    }
    .bold {
      font-weight: bold;
    }
    .underline {
      text-decoration: underline;
    }
    .indent1 {
      text-indent: 1em;
    }
    .indent2 {
      text-indent: 2em;
    }
    .margin0 {
      margin-bottom: 6px;
    }
    .margin1 {
      margin-bottom: 12px;
    }
    .margin2 {
      margin-bottom: 20px;
    }
  }
</style>